package com.example.myapplication.data

data class Expense(
    val id: Long = 0L,                // ไว้ใช้เป็น primary key ถ้าเก็บในฐานข้อมูล
    val amount: Double,               // จำนวนเงิน
    val title: String,                // ชื่อเรื่อง/รายละเอียด
    val type: String,                 // ประเภท: "รายรับ" หรือ "รายจ่าย"
    val category: String,             // หมวดหมู่ เช่น "🍔 อาหาร"
    val date: Long,                   // วันที่ในรูปแบบ timeInMillis
    val hour: Int,                    // ชั่วโมงที่เลือก
    val minute: Int                   // นาทีที่เลือก
)
